{"sections":{"main":{"type":"main-page","disabled":true,"custom_css":[],"settings":{"padding_top":0,"padding_bottom":0}},"custom_liquid_jWmNDb":{"type":"custom-liquid","name":"t:sections.custom-liquid.presets.name","settings":{"custom_liquid":"<h1 style=\"text-align: center;\">Our Story<\/h1>","color_scheme":"","padding_top":0,"padding_bottom":0}},"rich_text_fYWWXW":{"type":"rich-text","blocks":{"heading_zdq6Mm":{"type":"heading","disabled":true,"settings":{"heading":"Our Story","heading_size":"h1"}},"text_64VkYn":{"type":"text","disabled":true,"settings":{"text":"<p>At Soham Siddhatatvam, we believe in the wisdom of Ayurveda, an ancient holistic healing system that emphasizes the harmony between body, mind, and environment.<\/p><p>The journey of 'Soham' began during the Covid-period , when people actually started going back to our roots of Ayurveda for better immunity and overall wellness, but were confused about what's authentic. Each product in our collection is infused with the finest natural ingredients, sourced ethically and processed with utmost care, ensuring their purity and potency.<\/p><p>With the knowledge and trust of about 11 generations passed onto us, we believe that our products can bring a positive change in your life with just a few simple changes.<\/p><p>Whether you're seeking relief from stress, promoting digestion, or improving immunity, our herbal supplements are meticulously formulated to address a variety of health concerns. These supplements restore equilibrium to your body's natural rhythms, supporting your overall vitality and restoring harmony to your life.<\/p><p>Since its inception, the brand has been able to reach out to over 5 Lakh people with its Quality products and aims to continue this journey by introducing more such products.<\/p><p>Our Passion for serving the community with the best Quality products remains at the heart of all the business activities.The Organisation's collaborations and associations spread across the country with the top ayurvedic physicians and practisioners on the panel to ensure only the authentic and pure recipes are used in the production.<\/p><p>The brand envisions a dream of creating a community which is concious of Ayurvedic Products and ensure its usage in day to day life to maintain a healthy lifestyle. Unleash the power of nature and let Soham be your trusted companion in your quest for holistic well-being.<\/p>"}},"heading_DGiVJX":{"type":"heading","settings":{"heading":"<strong>Soham Siddhatatvam: A Timeless Heritage of Wellness<\/strong>","heading_size":"h2"}},"text_jMXQxX":{"type":"text","settings":{"text":"<p>'Soham' (Sanskrit; सो ऽहम्) is a journey of oneself to connect with their mind and body to achieve a healthy and fulfilled life.<br\/>We are simply enabling the Wisdom of Ayurveda for those who wish to attain a healthy lifestyle.<br\/>Our products are prepared with utmost love and care, keeping in mind the core science of Ayurveda and it's innumerable benefits to mankind.<br\/>|| ॐ सर्वे भवन्तु सुखिनः सर्वे सन्तु निरामयाः || (May all be happy, may all be healthy) is our inspiration to create a brand of high quality and value which is accessible for all<\/p>"}},"heading_QNtYYK":{"type":"heading","settings":{"heading":"<strong>Empowering Wellness, Embracing Tradition<\/strong>","heading_size":"h2"}},"text_AAakbz":{"type":"text","settings":{"text":"<p>Soham Siddhatatvam is proud to be led by our dedicated co-founders, Shubham Mundada, Manmohan Mantri, and Nilesh Sarda. Their vision and commitment continue to drive our mission of delivering wellness through the power of tradition and innovation.<\/p><p>We at Soham Siddhatatvam are guardians of a tradition spanning generations. Using centuries' worth of experience and wisdom, Soham Siddhatatvam was founded with the goal of providing efficiency and authenticity in all of our products. Every formulation, which is made with components that are ethically obtained and carefully handled, is a tribute to our dedication to purity and integrity. We aim to make a positive impact on millions of lives through our holistic solutions, guided by the blessings of our ancestors.<\/p><p>Each procedure, created with ingredients that have been responsibly sourced and handled with care, is a testament to our commitment to honesty and purity. Using the age-old technique, our body coolant and antioxidants treats problems including acidity, mouth ulcers, and heat boils. Through the Avaleha Siddhi method, our product helps improve the digestion, strengthens immunity, and improves skin, hair, and vision. Some of our products help promote mobility and reduces stiffness in the joints and muscles, offering immediate relief from ailments including osteoarthritis and sports injuries. <\/p><p>Using nine priceless herbs, and using the Sneh Pak Vidhi method, one of our product nourishes hair, delays the onset of greying, and adds volume. Inspired by the blessings of our ancestors, we hope that our holistic solutions can improve the lives of millions of people. <\/p><p>Discover more and begin your journey towards holistic wellness with Soham Siddhatatvam. Come together with us to create a community that respects the therapeutic benefits of Ayurveda and encourages a wholesome, dynamic way of living. Let Soham Siddhatatvam be your reliable guide to overall health and well-being.<\/p>"}}},"block_order":["heading_zdq6Mm","text_64VkYn","heading_DGiVJX","text_jMXQxX","heading_QNtYYK","text_AAakbz"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":0,"padding_bottom":52}},"contact_form_FpEcqY":{"type":"contact-form","settings":{"heading":"Get In Touch!","heading_size":"h2","color_scheme":"","padding_top":36,"padding_bottom":36}},"171802240346f53776":{"type":"apps","blocks":{"instafeed_app_block_Fw4a7i":{"type":"shopify:\/\/apps\/instafeed\/blocks\/app-block\/c447db20-095d-4a10-9725-b5977662c9d5","settings":{"title":"","title_color":"","title_size_v2":0,"alignment":"center","instafeed_margin_top":0,"instafeed_margin_bottom":0,"instafeed_margin_sides":0,"show_instagram_link":false,"link_alignment":"left","link_color":"#000000","background_color":"","feed_id":"","html_area":""}}},"block_order":["instafeed_app_block_Fw4a7i"],"settings":{"include_margins":true}},"custom_liquid_XG6m8n":{"type":"custom-liquid","settings":{"custom_liquid":"","color_scheme":"","padding_top":12,"padding_bottom":12}}},"order":["main","custom_liquid_jWmNDb","rich_text_fYWWXW","contact_form_FpEcqY","171802240346f53776","custom_liquid_XG6m8n"]}