{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_NmXGK8":{"type":"rich-text","blocks":{"heading_QkPxRq":{"type":"heading","settings":{"heading":"Why Ayurveda ?","heading_size":"h1"}},"text_qFCejP":{"type":"text","settings":{"text":"<p><em>“Ayurveda is the most sacred science of life”<br\/>– Charak Samhita<\/em><\/p><p>The well known Sanskrit term “Ayurveda” simply translates to <strong>‘Knowledge of Life’<\/strong>. The foundation of this great ancient wisdom tells us that when you harmonize the tuning between your mind and body, you achieve total wellness. Ayurveda is so much more than just providing treatment to the body. It's a holistic and natural approach to heal one's emotional, physical and mental health. In Ayurveda it is believed that everything is connected and this connection is what we rely on to achieve ultimate wellness and balance in life. The five senses serve as the portals between the two realms of mind and body, as the five great elements of earth,fire, water, air and ether. They create a divine medley to form a melodious life. In Ayurveda, it is said that, in everyone and everything, these three basic energies exist. They're called doshas. The doshas guide us to understanding the body's physical and emotional strengths and weaknesses. Ayurveda is all about finding a balance among the three Doshas ; Vata, Pitta and Kapha.<\/p><p><\/p><h3><strong>Vata Dosha<\/strong><\/h3><p>It is associated with the energy of movement which is most often connected to Air & Ether. The natural tendency is to draw itself to the qualities of Air, Space & Ether that is flowing, spirituality & easy movement.<\/p><h3><strong>Pitta Dosha<\/strong><\/h3><p>It is the mind body element that is based with Fire and Water. Pitta is the energy that dictates the body's metabolism and transformation.<\/p><h3><strong>Kapha Dosha<\/strong><\/h3><p>It has the qualities reflecting the elements of Water and Earth. It is the dosha that tends to hold things together. It is stable, cohesive and steady.<\/p><h2><strong>Why Choose Ayurveda?<\/strong><\/h2><p><em>\"As long as we are not living in harmony with nature and our constitution, we cannot expect <\/em>ourselves<em> to be really healed. Ayurveda gives us the means.\"<\/em><\/p><p>The foundation of Ayurveda dates back to 5000 years and it is backed by years of trust, research and results. It is a holistic approach that embraces the balance and connection between your body and mind. It aims to not only cure the symptoms but tries to reach it's root problem. Ayurveda is not a treatment but it is a lifestyle. It is truly moldable to one's pathya, that is the way one leads their life, which involves their lifestyle, diet, mental wellbeing, physical fitness, and the other things<\/p><p>that a person practices in their day to day. When you can approach life in the most natural and scientifically proven way through Ayurveda, our question is ; <strong>Why not Ayurveda?<\/strong><\/p><p><\/p>"}},"button_LaYzmY":{"type":"button","settings":{"button_label":"Shop Now","button_link":"","button_style_secondary":false,"button_label_2":"","button_link_2":"","button_style_secondary_2":false}}},"block_order":["heading_QkPxRq","text_qFCejP","button_LaYzmY"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}},"17180225236678dd3d":{"type":"apps","blocks":{"instafeed_app_block_3p9x49":{"type":"shopify:\/\/apps\/instafeed\/blocks\/app-block\/c447db20-095d-4a10-9725-b5977662c9d5","settings":{"title":"","title_color":"","alignment":"center","html_area":""}}},"block_order":["instafeed_app_block_3p9x49"],"settings":{"include_margins":true}}},"order":["main","rich_text_NmXGK8","17180225236678dd3d"]}